pandas

In [ ]:
!pip install numpy

In [14]:
import numpy as np
import pandas as pd

In [15]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(labels)
d={'a':10,'b':20,'c':30}
print(labels)
print(my_data)

['a', 'b', 'c']
[10, 20, 30]

In [16]:
#print(pd.Series(labels))
#print(pd.Series(d))

print(pd.Series(data=my_data,index=labels))

a    10
b    20
c    30
dtype: int64

In [9]:
print(pd.Series(arr))

0    a
1    b
2    c
dtype: object

In [17]:
print(pd.Series(data=[sum,print,len]))

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [18]:
ser1=pd.Series([1,2,3,4],['USA','INDIA','ENGLAND','USSR'])
print(ser1)

USA        1
INDIA      2
ENGLAND    3
USSR       4
dtype: int64

In [19]:
ser2=pd.Series([1,2,3,4],['USA','INDIA','ITALY','CHINA'])
print(ser1)

USA        1
INDIA      2
ENGLAND    3
USSR       4
dtype: int64

In [47]:
ser1+ser2

CHINA      NaN
ENGLAND    NaN
INDIA      4.0
ITALY      NaN
USA        2.0
USSR       NaN
dtype: float64

DATA FRAMES

In [24]:
from numpy.random import randn
np.random.seed(101)

In [25]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [29]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [30]:
df['new']=df['X']+df['Y']
print(df)
df.drop('new',axis=1)
#print(df)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
##but df still have new argument
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D   True  False  False   True  False
E   True   True   True   True   True

In [32]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D   True  False  False   True  False
E   True   True   True   True   True

In [33]:
booldf=df>0
print(df[booldf])

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  1.268936
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [34]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [35]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [36]:
df[df['W']<0]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001  1.268936

In [37]:
resultdf=df[df['W']>0]
print(resultdf['X'])

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [38]:
resultdf2=df[df['W']>0][['Y','X']]
print(resultdf2)

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [39]:
boolser=df[df['W']>0]
res=['Y','X']
ress=boolser[res]
print(ress)
print(df)

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757
          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [40]:
df[(df['X']<0) & (df['Y']<0)]

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [41]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  1.536102
1     B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
2     C -2.018168  0.740122  0.528813 -0.589001  1.268936
3     D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
4     E  0.190794  1.978757  2.605967  0.683509  4.584725

In [42]:
newind='CA IN THE FUTURE STAKE'.split()
print(newind)

['CA', 'IN', 'THE', 'FUTURE', 'STAKE']

In [43]:
df['states']=newind
print(df)

          W         X         Y         Z       new  states
A  2.706850  0.628133  0.907969  0.503826  1.536102      CA
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395      IN
C -2.018168  0.740122  0.528813 -0.589001  1.268936     THE
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109  FUTURE
E  0.190794  1.978757  2.605967  0.683509  4.584725   STAKE

In [44]:
df.set_index('states')

               W         X         Y         Z       new
states
CA      2.706850  0.628133  0.907969  0.503826  1.536102
IN      0.651118 -0.319318 -0.848077  0.605965 -1.167395
THE    -2.018168  0.740122  0.528813 -0.589001  1.268936
FUTURE  0.188695 -0.758872 -0.933237  0.955057 -1.692109
STAKE   0.190794  1.978757  2.605967  0.683509  4.584725

In [45]:
df

          W         X         Y         Z       new  states
A  2.706850  0.628133  0.907969  0.503826  1.536102      CA
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395      IN
C -2.018168  0.740122  0.528813 -0.589001  1.268936     THE
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109  FUTURE
E  0.190794  1.978757  2.605967  0.683509  4.584725   STAKE

DATA FRAME-3(multa indedx and index higher key)

In [58]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
print(heir_index)
heir_index=pd.MultiIndex.from_tuples(heir_index)
print(heir_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [59]:
##from scratch
df=pd.DataFrame(randn(6,2),heir_index,['A','B'])

In [60]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [61]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [62]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [63]:
df.index.names=['Group','Names']

In [52]:
df

                    A         B
Group Names
G1    1      0.302665  1.693723
      2     -1.706086 -1.159119
      3     -0.134841  0.390528
G2    1      0.166905  0.184502
      2      0.807706  0.072960
      3      0.638787  0.329646

In [53]:
df.loc['G2']

              A         B
Names
1      0.166905  0.184502
2      0.807706  0.072960
3      0.638787  0.329646

In [54]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [55]:
df.xs('G1')

              A         B
Names
1      0.302665  1.693723
2     -1.706086 -1.159119
3     -0.134841  0.390528

In [64]:
df.xs(1,level='Names')

              A         B
Group
G1    -0.497104 -0.754070
G2     0.238127  1.996652

missing Data

In [65]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}
print(d)

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [1, 2, 3]}

In [67]:
df=pd.DataFrame(d)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [68]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df.dropna(1)

   C
0  1
1  2
2  3

In [73]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [75]:
df.fillna(value='ram')

     A    B  C
0    1    1  1
1    2  ram  2
2  ram  ram  3

In [77]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

groupBy

In [79]:
data={'company':['Goog','Goog','Msft','Msft','Fb','Fb'],'person':['Sam','Charlie','Amy','Venesa','Carl','Sarah'],'sales':[200,120,340,124,243,350]}

In [80]:
data

{'company': ['Goog', 'Goog', 'Msft', 'Msft', 'Fb', 'Fb'],
 'person': ['Sam', 'Charlie', 'Amy', 'Venesa', 'Carl', 'Sarah'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [83]:
df2=pd.DataFrame(data)

In [84]:
df

  company   person  sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    Msft      Amy    340
3    Msft   Venesa    124
4      Fb     Carl    243
5      Fb    Sarah    350

In [86]:
bycomp=df.groupby('company')

In [88]:
bycomp.mean()

         sales
company
Fb       296.5
Goog     160.0
Msft     232.0

In [89]:
bycomp.std()

              sales
company
Fb        75.660426
Goog      56.568542
Msft     152.735065

In [91]:
bycomp.sum()

         sales
company
Fb         593
Goog       320
Msft       464

In [93]:
df.groupby('company').sum().loc['Fb']

sales    593
Name: Fb, dtype: int64

In [94]:
df.groupby('company').count()

         person  sales
company
Fb            2      2
Goog          2      2
Msft          2      2

In [95]:
df.groupby('company').min()

          person  sales
company
Fb          Carl    243
Goog     Charlie    120
Msft         Amy    124

In [97]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
Fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [98]:
df.groupby('company').describe().transpose()

company              Fb        Goog        Msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [100]:
df.groupby('company').describe().transpose()['Fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Fb, dtype: float64

Merging,Joining,Concatiiong